spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2007.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
    <application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
    <application_flow_id>2007</application_flow_id>                                     <!-- Application flow (business process) - Close terminal -->
    <application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
    <operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
    <institution_id>1001</institution_id>                                               <!-- Institution identifier -->
    <agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
    <customer>
        <command>CMMDEXPR</command>                                                     <!-- Command for customer - find existing customer -->
        <customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
        <contract>
            <command>CMMDEXPR</command>                                                 <!-- Command for contract - find existing contract -->
            <contract_number>00000000000000000000000000000736</contract_number>         <!-- Contract number -->
            <merchant id="merchant_1">
                <command>CMMDEXPR</command>                                             <!-- Command for merchant - find existing merchant -->
                <merchant_number>000000070000063</merchant_number>                      <!-- Merchant number -->
                <terminal id="terminal_1">
                    <command>CMMDEXRE</command>                                         <!-- Remove terminal -->
                    <terminal_number>00000001</terminal_number>                         <!-- Terminal number -->
                </terminal>
            </merchant>
        </contract>
    </customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
